x = float(input())
y = float(input())
if (x ** 2 + y ** 2) ** 0.5 > 10:
    print("Вы вышли в море и рискуете быть съеденным акулой!")
else:
    if (x >= 0 and y >= 0 and (x ** 2 + y ** 2) ** 0.5 <= 5) \
            or (-4 <= x <= 0 and 0 <= y <= 5) \
            or (-7 <= x <= -4 and 0 <= y <= (x * 5 / 3 + 7 * 5 / 3)) \
            or (-7 <= x <= 5 and ((x + 1) ** 2) / 4 - 9 <= y <= 0):
        print("Опасность! Покиньте зону как можно скорее!")
    else:
        print("Зона безопасна. Продолжайте работу.")
